#+TITLE:A GNU Emacs Config
#+AUTHOR: Kay Zero
#+DESCRIPTION: k's personal Emacs config.

** Treesitter
- Color me impressed
#+begin_src emacs-lisp
  ;; Define languages to install
  (setq treesit-language-source-alist
        '((python "https://github.com/tree-sitter/tree-sitter-python")
          (javascript "https://github.com/tree-sitter/tree-sitter-javascript")
          (typescript "https://github.com/tree-sitter/tree-sitter-typescript")
          (c       "https://github.com/tree-sitter/tree-sitter-c")
  		(lua "https://github.com/tree-sitter-grammars/tree-sitter-lua")
          (cpp     "https://github.com/tree-sitter/tree-sitter-cpp")
          (rust    "https://github.com/tree-sitter/tree-sitter-rust")
          (go      "https://github.com/tree-sitter/tree-sitter-go")
  		(julia  "https://github.com/tree-sitter/tree-sitter-julia")
          (java    "https://github.com/tree-sitter/tree-sitter-java")))

  (setq treesit-font-lock-level 4)
  (use-package treesit-auto
      :ensure t
      :custom
      (treesit-auto-install 'prompt)
      :config
      (treesit-auto-add-to-auto-mode-alist 'all)
      (global-treesit-auto-mode))
#+end_src

#+RESULTS:
: [nil 26967 50600 232407 nil elpaca-process-queues nil nil 256000 nil]


